# SetClassByStyle

## Description
```pascal
FUNCTION SetClassByStyle(
				hObject : HANDLE;
				byStyle : BOOLEAN) : BOOLEAN;
```

```python

def vs.SetClassByStyle(hObject, byStyle):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE||
|byStyle|BOOLEAN||

## Version
Availability: from Vectorworks 2021
## Category
* Objects - Custom